# Specify a directory to install casks
cask_args appdir: '~/Applications'

# Tap necessary repos
tap 'homebrew/bundle'

# Brew formulae
brew 'awscli'
brew 'bat'
brew 'cod-cli'
brew 'fzf'
brew 'gds-cli'
brew 'go'
brew 'nvm'
brew 'pre-commit'
brew 'pwgen'
brew 'pyenv'
brew 'rbenv'
brew 'rdap'
brew 'stow'
brew 'tfenv'
brew 'uv'
brew 'ykman'
brew 'zsh-vi-mode'

# Casks
cask 'aws-vault'
cask 'docker'
cask 'ghostty'
cask 'obsidian'
cask 'zoom'
cask 'bitwarden'
cask 'firefox'
cask 'slack'
